//************************************************************************
// 呼び出し実行モジュールプログラム
//************************************************************************

#include "mruby.h"

//**************************************************
//  スクリプト言語を実行します
//**************************************************
void	VmRun( void );

//**************************************************
//  エラーメッセージを送信します
//**************************************************
void	ErrorSend( int err, char *mes );

//**************************************************
//  エラーメッセージ
//**************************************************
//void	VmErrorMes( lua_State *LuaLinkP, char* mes, int type );

//**************************************************
//  VM終了メッセージ
//**************************************************
void VmFinishMes( mrb_state *mrb );

//**************************************************
//マウントされているsdcardのフォルダ名を取得します。
// 戻り値 -1:エラー 0:成功
//**************************************************
int	getMountSDCardName( void );

//**************************************************
//
// ScriptFilenameに初めに実行するファイル名(フォルダ名込み)を取得します。
// 戻り値 -1:エラー 0:成功
//
// 2-2-B.実行するluaファイル名を取得する: getRunfile(0x020B)
//	0x03 0x05  0x020B 0x06
//	戻りデータ
//	0x03 0xSS(全体サイズ) 0xRX(OK) 0xHS(Scriptファイル名長さ) 0xHM(Scriptファイル名) 0x06
//	0xRXの値
//		0x00: OK
//		0x46: エラー(終了)・・・javaはフラグで管理する
//
//	スクリプトファイル名の仕様 '/sdcad/sarida/test/test.lua'というように、フルパスで指定する。
//**************************************************
int	getStartScriptFilename( void );

//************************************************************************
// b[0],b[1],b[2],b[3]をfloatに変換します
//************************************************************************
float btof( unsigned char *b, int revFlg );
